<template>
  <div class="container">
    <div class="card border-0 mt-5" align="center">
      <h3>На даному сайті розташована система "Єдиного реєстру довіреностей",
        яку розроблено на замовлення Міністерства Юстиції України з метою забезпечення єдиного
        державного обліку довіреностей та їх дублікатів.</h3>
      <h3 class="mt-5">У розробленій системі авторизований Користувач має можливість
        перевірити дійсність довіреності та отримати інформацію про внесені до ЄРД реєстраційні записи
        про довіреності та дублікати, у тому числі у вигляді скорочених витягів.</h3>
      <h3 class="mt-5">У розробленій системі авторизований Реєстратор має можливість зареєструвати довіреність,
        зареєструвати дублікат довіреності, відредагувати помилково внесені у довіреність дані,
        перевірити дійсність довіреності та отримати інформацію про внесені до ЄРД реєстраційні записи
        про довіреності та дублікати, у тому числі у вигляді скорочених витягів.</h3>
      <h3 class="mt-5">Інформація надана у відповідності із
        <a href="https://zakon.rada.gov.ua/laws/show/z1378-06">Законом України "Про запровадження Єдиного реєстру довіреностей
        та внесення змін і доповнень до деяких нормативно-правових актів Міністерства юстиції України"</a></h3>
    </div>
  </div>
</template>

<script>
import UserService from '../services/user.service';

export default {
  name: 'Home',
  data() {
    return {
      content: ''
    };
  },
  mounted() {
    UserService.getPublicContent().then(
      response => {
        this.content = response.data;
      },
      error => {
        this.content =
          (error.response && error.response.data && error.response.data.message) ||
          error.message ||
          error.toString();
      }
    );
  }
};
</script>
<style scoped>
.container {
  margin-top: 1rem;
}
</style>